Revit 2027 API
BuiltInFailures.GeneralFailures.NameNotUnique Property
 The name entered is already in use. Enter a unique name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NameNotUnique { get; }
Public Shared ReadOnly Property NameNotUnique As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NameNotUnique {
	FailureDefinitionId^ get ();
}
static member NameNotUnique : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GeneralFailures Class
Autodesk.Revit.DB Namespace